app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all.paginate(:page => params[:page], :per_page => 4)
---
SELECT  `clientes`.* FROM `clientes` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `clientes`

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`nome`, `email`, `created_at`, `updated_at`) VALUES ('Johan Sousa', 'johan.maia.sousa@gmail.com', '2017-03-21 08:23:36', '2017-03-21 08:23:36')

  def destroy
    @cliente.destroy
---
DELETE FROM `clientes` WHERE `clientes`.`id` = 10